***8. This question involves the use of simple linear regression on the Auto data set***

In [42]:
import pandas as pd

In [43]:
auto = pd.read_csv('Auto.csv')
auto.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino

In [44]:
auto = auto[['horsepower', 'mpg']]
auto.head()

  horsepower   mpg
0        130  18.0
1        165  15.0
2        150  18.0
3        150  16.0
4        140  17.0

In [45]:
# display the rows and columns values of the dataset
auto.shape

(397, 2)

In [46]:
# display how many non values of the dataset and what is the type of each column
auto.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 397 entries, 0 to 396
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   horsepower  397 non-null    object
 1   mpg         397 non-null    float64
dtypes: float64(1), object(1)
memory usage: 6.3+ KB

In [47]:
# count number of unique values for each columns
auto.nunique()

horsepower     94
mpg           129
dtype: int64

In [48]:
# Convert 'horsepower' to numeric, if errors in some rows than to NaN for that row's value
# error = 'coerce', any value that cannot be converted to a number (such as a string or a character like '?')
auto['horsepower'] = pd.to_numeric(auto['horsepower'], errors='coerce')

In [57]:
# drop the rows where nan values
auto.dropna(inplace=True)